In [3]:
import pandas as pd
titles_csv = "Data/titles.csv"
#salaries.csv
#employees.csv
#dept_manager.csv
#dept_emp.csv


df = pd.read_csv(titles_csv)
df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [4]:
def year_change (df):
    df['to_date'].replace(9999,1999)

In [5]:
year_change(df)

In [29]:
df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [39]:
wyear=df['to_date'].head(5)

In [40]:
for index,row in wyear.iterrows():
    x=year.replace("9999","1999")

1999-01-01
1999-01-01
1999-01-01
1995-12-01
1999-01-01